src/cf/Reports/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/Reports/ОстаткиДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПослеКомпоновкиМакета",  Ложь);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Ложь);

	Возврат Результат;

КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	Возврат "Остатки денежных средств на " + Формат(ПараметрыОтчета.Период, "ДФ=dd.MM.yyyy; ДП=...");
		
КонецФункции

// Формирует таблицу данных для монитора руководителя по организации на дату
// Параметры
// 	Организация - СправочникСсылка.Организации - Организация по которой нужны данные
// 	Дата - Дата - дата на которую нужны остатки
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица с данными для монитора руководителя
//
Функция ПолучитьОстаткиДенежныхСредствДляМонитораРуководителя(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Если КонецДня(ТекущаяДатаСеанса()) = КонецДня(Дата) Тогда
		// Если остатки получаются "на сегодня", то обращаемся к текущим итогам регистра.
		Запрос.УстановитьПараметр("Период", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	КонецЕсли;
	Запрос.УстановитьПараметр("ВедетсяУчетПоВалютам", БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
	
	// ВалютаРегламентированногоУчета пронадобится еще раз ниже
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	// Получим список счетов кассы для отбора
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Касса));
	// Уберем из иерархии счета по которым не хотим отбирать
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументы)); 
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал)); 
	Запрос.УстановитьПараметр("СчетаКассы", СписокСчетов);
	
	// Получим список счетов безналичных расчетов для отбора
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);   // 51
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);    // 52
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СпециальныеСчета); // 55
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПереводыВПути_);   // 57
	СписокСчетов = БухгалтерскийУчет.СформироватьМассивСубсчетов(СписокСчетов);
	
	// Уберем из иерархии счета по которым не хотим отбирать
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)); 
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)); 
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты)); 
	
	Запрос.УстановитьПараметр("СчетаУчетаБезналичные", СписокСчетов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаКассы), , Организация = &Организация) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт) КАК Сумма,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.Валюта, &ВалютаРегламентированногоУчета) КАК Валюта,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт, 0) КАК СуммаВВалюте,
		|	ХозрасчетныйОстатки.Валюта.Наименование КАК ВалютаНаименование
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаУчетаБезналичные), , Организация = &Организация) КАК ХозрасчетныйОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ХозрасчетныйОстатки.Валюта, &ВалютаРегламентированногоУчета),
		|	ЕСТЬNULL(ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт, 0),
		|	ХозрасчетныйОстатки.Валюта.Наименование";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаДанных = МониторРуководителя.ТаблицаДанных();
	ИтогоВКассе = 0;
	
	// Касса 
	ТаблицаОстатковВКассе = Результат[0].Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	Для Каждого СтрокаКасса Из ТаблицаОстатковВКассе Цикл
		
		СтрокаДанных = ТаблицаДанных.Добавить();
		СтрокаДанных.Представление 		= НСтр("ru = 'В кассе'");
		СтрокаДанных.ДанныеРасшифровки 	= ВалютаРегламентированногоУчета;
		СтрокаДанных.Порядок       		= ПорядокКассыВМониторе();
		СтрокаДанных.Сумма         		= СтрокаКасса.Сумма;
		ИтогоВКассе = ИтогоВКассе + СтрокаКасса.Сумма;

	КонецЦикла;   
	
	// Подготовим переменные которые будем использовать при заполнении таблицы
	ПредставлениеДляРублевыхСчетов = НСтр("ru = 'На рублевых счетах'");
	
	ИтогоНаРасчетныхСчетах = 0;
	// Расчетные счета 
	ТаблицаОстатковНаСчетах = Результат[1].Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Для Каждого СтрокаНаСчетах Из ТаблицаОстатковНаСчетах Цикл
		
		ВалютаОстатка        = СтрокаНаСчетах.Валюта;
		
		// Для рублевых счетов особенное представление и порядок
		Если ВалютаОстатка = ВалютаРегламентированногоУчета Тогда
			ПредставлениеОстатка = ПредставлениеДляРублевыхСчетов;
			Порядок = ПорядокРублевыхСчетовВМониторе();
		Иначе
			ПредставлениеОстатка = СтрокаНаСчетах.ВалютаНаименование;
			Порядок = ПорядокВалютныхСчетовВМониторе();
		КонецЕсли;
		
		СтрокаДанных = ТаблицаДанных.Добавить();
		СтрокаДанных.Представление 		= ПредставлениеОстатка;
		СтрокаДанных.ДанныеРасшифровки  = ВалютаОстатка;
		СтрокаДанных.Порядок       		= Порядок;
		СтрокаДанных.Сумма         		= СтрокаНаСчетах.Сумма;
		СтрокаДанных.СуммаВВалюте  		= СтрокаНаСчетах.СуммаВВалюте;
		ИтогоНаРасчетныхСчетах = ИтогоНаРасчетныхСчетах + СтрокаНаСчетах.Сумма;
		
	КонецЦикла;   
	
	
	// Добавляем итог по разделу
	СтрокаДанных = ТаблицаДанных.Добавить();
	СтрокаДанных.Представление = НСтр("ru = 'Итого'"); 
	СтрокаДанных.Порядок       = ПорядокИтоговВМониторе();
	СтрокаДанных.Сумма         = ИтогоВКассе + ИтогоНаРасчетныхСчетах;
	
	Возврат ТаблицаДанных;
	
КонецФункции 

// Формирует таблицу данных для монитора руководителя по организации на дату
// Параметры
// 	Организация - СправочникСсылка.Организации - Организация по которой нужны данные
// 	Дата - Дата - дата на которую нужны остатки
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица с данными для монитора руководителя
//
Функция ПолучитьОстаткиДенежныхСредствДляМонитораРуководителяСводно(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Если КонецДня(ТекущаяДатаСеанса()) = КонецДня(Дата) Тогда
		// Если остатки получаются "на сегодня", то обращаемся к текущим итогам регистра.
		Запрос.УстановитьПараметр("Период", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	КонецЕсли;
	
	// Получим список счетов кассы для отбора
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Касса));
	// Уберем из иерархии счета по которым не хотим отбирать
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументы)); 
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетов,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал)); 
	
	СписокСчетовБезналичные = Новый Массив;
	СписокСчетовБезналичные.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);   // 51
	СписокСчетовБезналичные.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);    // 52
	СписокСчетовБезналичные.Добавить(ПланыСчетов.Хозрасчетный.СпециальныеСчета); // 55
	СписокСчетовБезналичные.Добавить(ПланыСчетов.Хозрасчетный.ПереводыВПути_);   // 57
	СписокСчетовБезналичные = БухгалтерскийУчет.СформироватьМассивСубсчетов(СписокСчетовБезналичные);
	
	// Уберем из иерархии счета по которым не хотим отбирать
	СписокСчетовБезналичные = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетовБезналичные,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)); 
	СписокСчетовБезналичные = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетовБезналичные,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)); 
	СписокСчетовБезналичные = ОбщегоНазначенияКлиентСервер.СократитьМассив(СписокСчетовБезналичные,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты)); 
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСчетов,СписокСчетовБезналичные);
	
	Запрос.УстановитьПараметр("Счета", СписокСчетов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&Счета), , Организация = (&Организация)) КАК ХозрасчетныйОстатки";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТаблицаДанных = МониторРуководителя.ТаблицаДанных();
	
	// Добавляем итог по разделу
	СтрокаДанных = ТаблицаДанных.Добавить();
	СтрокаДанных.Представление = НСтр("ru = 'Итого'");
	СтрокаДанных.Порядок       = ПорядокИтоговВМониторе();
	СтрокаДанных.Сумма         = Выборка.Сумма;
	
	Возврат ТаблицаДанных;
	
КонецФункции 

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Рубль", Константы.ВалютаРегламентированногоУчета.Получить());
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВедетсяУчетПоВалютам", БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
    
	Если ЗначениеЗаполнено(ПараметрыОтчета.Период) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Период", КонецДня(ПараметрыОтчета.Период) + 1);
	КонецЕсли;
	
	Таблица = Неопределено;
	Для Каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл		
		Если ЭлементСтруктуры.Имя = "Таблица" Тогда
			Таблица = ЭлементСтруктуры;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если Таблица <> Неопределено Тогда
		// Группировка
		Таблица.Строки.Очистить();
		Группировка = Таблица.Строки;
		Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
			Если ПолеВыбраннойГруппировки.Использование Тогда
				Если ТипЗнч(Группировка) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных") Тогда
					Группировка = Группировка.Добавить();
				Иначе
					Группировка = Группировка.Структура.Добавить();
				КонецЕсли;
				БухгалтерскиеОтчетыВызовСервера.ЗаполнитьГруппировку(ПолеВыбраннойГруппировки, Группировка);				
			КонецЕсли;
		КонецЦикла;
		Если Не БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет() Тогда
			Для Каждого ЭлементСтруктуры Из Таблица.Колонки Цикл
				Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
					Если Строка(ПолеГруппировки.Поле) =  "Валюта" Тогда
						ЭлементСтруктуры.Использование = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	// Дополнительные данные
	БухгалтерскиеОтчетыВызовСервера.ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек);
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
КонецПроцедуры

Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиДенежныхСредств").Размещение.Вставить(Метаданные.Подсистемы.Руководителю82.Подсистемы.ДенежныеСредства, "");
	ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиДенежныхСредств").Размещение.Вставить(Метаданные.Подсистемы.Руководителю.Подсистемы.ДенежныеСредства, "");
	
КонецПроцедуры

//Процедура используется подсистемой варианты отчетов
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Для Каждого Вариант из Схема.ВариантыНастроек Цикл
		 Настройки.ОписаниеВариантов.Вставить(Вариант.Имя,Вариант.Представление);
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПорядокИтоговВМониторе() Экспорт
	
	Возврат 0;
	
КонецФункции

Функция ПорядокКассыВМониторе() Экспорт
	
	Возврат 1;
	
КонецФункции

Функция ПорядокРублевыхСчетовВМониторе() Экспорт
	
	Возврат 2;
	
КонецФункции

Функция ПорядокВалютныхСчетовВМониторе() Экспорт
	
	Возврат 3;
	
КонецФункции

#КонецЕсли
